---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExternallyTaggedGeometryValidation
source: html/bb10b738-adbe-0e83-f536-e5ef4a71c190.htm
---
# ExternallyTaggedGeometryValidation Methods

Makes sure that the input geometry object is not a Solid.